Documents/УдержаниеПоИсполнительнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УдержаниеПоИсполнительнымЛистам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПерсоналом</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УдержаниеПоИсполнительнымЛистам/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеДокумента.Ссылка КАК Ссылка,
	                      |	ДанныеДокумента.Ссылка.Дата КАК Период,
	                      |	ДанныеДокумента.Ссылка.Организация КАК Организация,
	                      |	ДанныеДокумента.ФизЛицо КАК ФизЛицо,
	                      |	СУММА(ДанныеДокумента.Сумма) КАК Сумма
	                      |ИЗ
	                      |	Документ.УдержаниеПоИсполнительнымЛистам.ФизическиеЛица КАК ДанныеДокумента
	                      |ГДЕ
	                      |	ДанныеДокумента.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДанныеДокумента.ФизЛицо,
	                      |	ДанныеДокумента.Ссылка,
	                      |	ДанныеДокумента.Ссылка.Дата,
	                      |	ДанныеДокумента.Ссылка.Организация");
						  
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
 	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// МассивРезультатов[0] - ВременнаяТаблицаОплатаПоставщикам
	СтруктураДополнительныеСвойства.Вставить("ТаблицаДанных", МассивРезультатов[0].Выгрузить());
	
КонецПроцедуры
